export default function Declaration() {
  return (
    <section className="declaration">
      <div className="declaration-inner">
        <h1>선언</h1>

        <p>
          함께 지어져 가는 교회를 위해 기도합시다. 두나미스를 위해 기도합시다.
          사랑의교회를 위해 기도합시다. 주변 이웃을 위해 기도합시다.
          중보한 후에 중보했다고 알리겠습니다.
        </p>

        <p>
          뜨겁지 않아도 잔잔히 꾸준히 기도하겠습니다.
          그 한사람 한사람을 위해 기도하고 그 한 사람을 더 알아가기 위해 노력하겠습니다.
          제 의가 살면 파멸일 뿐이라는 것을 깨닫고 내가 나서는 것은 줄이고
          경청하는 사람이 되겠습니다. 세상을 위해서도 기도하겠습니다.
        </p>

        <p>
          자기 만족을 위해 기도하지 않겠습니다.
          기도하다가 마음이 충만함을 느끼고 싶지 않습니다.
          힘들더라도 저는 이 길을 걸을 겁니다.
          사랑할 수 없는 순간에도 사랑할 것이고
          기도할 수 없는 순간에도 기도하겠습니다.
        </p>

        <p className="date">2026.02.27</p>
      </div>
    </section>
  );
}